IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM3_CONTROLSS_G2_EPWM3.xml
	<register id="CONTROLSS_G2_EPWM3_DCFWINDOW" acronym="CONTROLSS_G2_EPWM3_DCFWINDOW" offset="0x196" width="16" description="Digital Compare Filter Window Register">
		<bitfield id="DCFWINDOW" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Width   00h: No blanking window is generated.  01-FFFFh: Specifies the width of the blanking window in TBCLK cycles. The blanking window begins when the offset counter expires. When this occurs, the window counter is loaded and begins to count down. If the blanking window is currently active and the offset counter expires, the blanking window counter is not restarted and the blanking window is cut short prematurely. Care should be taken to avoid this situation. The blanking window can cross a PWM period boundary." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM3_DCFWINDOWCNT" acronym="CONTROLSS_G2_EPWM3_DCFWINDOWCNT" offset="0x198" width="16" description="Digital Compare Filter Window Counter Register">
		<bitfield id="DCFWINDOWCNT" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Counter  These 16 bits are read only and indicate the current value of the window counter. The counter counts down to zero and then stops until it is re-loaded when the offset counter reaches zero again." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G2_EPWM3_BLANKPULSEMIXSEL" acronym="CONTROLSS_G2_EPWM3_BLANKPULSEMIXSEL" offset="0x19A" width="16" description="Blanking window trigger pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [BLANKPULSEMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [BLANKPULSEMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [BLANKPULSEMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [BLANKPULSEMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM3_DCCAPMIXSEL" acronym="CONTROLSS_G2_EPWM3_DCCAPMIXSEL" offset="0x19C" width="16" description="Capture Event pulse select register">
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [DCCAPMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the blanking window trigger [DCCAPMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the blanking window trigger [DCCAPMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x0" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the blanking window trigger [DCCAPMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x0" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the blanking window trigger [DCCAPMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
